Repository: FRI-UNIZA/jumpeno
Catalog: Jumpeno.Shared/Services/Internationalization/Translations/Resource.*.resx
Languages: sk

source: Error 404
sk: Chyba 404

source: Home
sk: Domov

source: 404 Not found
sk: 404 Nenájdené

source: Sorry, there's nothing at this address.
sk: Ospravedlňujeme sa, ale na tejto adrese sa nič nenachádza.

source: Reload page
sk: Obnoviť stránku

source: Error occurred
sk: Nastala chyba

source: Information
sk: Informácia

source: Notification
sk: Notifikácia

source: Success
sk: Úspech

source: Warning
sk: Varovanie

source: Something went wrong.
sk: Niečo sa pokazilo.

source: Version
sk: Verzia

source: Parsing error.
sk: Chyba parsovania.

source: Request cancelled.
sk: Žiadosť zrušená.

source: Request failed.
sk: Žiadosť zlyhala.

source: The theme was set successfully!
sk: Téma bola úspešne nastavená!

source: Wrong theme identifier!
sk: Nesprávny identifikátor témy!

# Have a nice game (game)
source: game
sk: hru

# Have a nice game (Have a nice)
source: Have a nice
sk: Prajeme príjemnú

source: Students from
sk: Študenti

source: Loading
sk: Načítavanie

source: Light theme
sk: Svetlá téma

source: Feedback
sk: Spätná väzba

source: Login
sk: Prihlásenie

source: Manual
sk: Návod

source: Watch
sk: Sledovať

source: Close
sk: Zavrieť

source: Page: I18N{page}
sk: Stránka: I18N{page}

source: Accept all
sk: Prijať všetky

source: Accept chosen
sk: Prijať vybraté

source: Allow functional cookies
sk: Povoliť funkčné cookies

source: Allow mandatory cookies
sk: Povoliť nevyhnutné cookies

# Cookie message cookie files (cookie files)
source: cookies
sk: súborov cookie

# Cookie message cookie files (Cookie message)
source: By using this page, you agree to the settings for selected
sk: Používaním tejto stránky vyjadrujete súhlas s nastavovaním zvolených

source: Cookie settings
sk: Nastavenia cookies

source: Empty
sk: Prázdne

source: Functional cookies
sk: Funkčné cookies

# Functional cookies text
source: These cookies allow websites to remember your preferences, interests or past items, for which you decided while browsing them or also your geographical location. In this way, we can adapt our website to you and provide a better presentation. Based on your geographic location, for example, we can provide you with a website in your language or remember your preferred color settings. These cookies do not identify you personally.
sk: Tieto súbory cookie webovým stránkam umožňujú zapamätať si Vaše preferencie, záujmy alebo minulé položky, pre ktoré ste sa rozhodli počas ich prehliadania alebo aj Vašu geografickú polohu. Môžeme Vám tak prispôsobiť našu webovú stránku a poskytnúť jej lepšiu prezentáciu. Na základe Vašej geografickej polohy Vám napríklad vieme poskytnúť webovú stránku vo Vašom jazyku alebo si zapamätať preferované nastavenia farieb. Tieto cookies Vás osobne neidentifikujú.

source: Mandatory cookies
sk: Nevyhnutné cookies

# Mandatory cookies text
source: These cookies are necessary for browsing our websites, services, applications and their individual elements. Without them, it is not possible to provide services such as login, security, saved search, etc.
sk: Tieto súbory cookie sú potrebné na prehliadanie našich webových stránok, služieb, aplikácií a jednotlivých ich prvkov. Bez nich nie je možné poskytovať služby ako prihlásenie, zabezpečenie, uložené vyhľadávanie a podobne.

source: Only mandatory
sk: Len nevyhnutné

source: Select language
sk: Zvoliť jazyk

source: Selected: I18N{option}
sk: Zvolené: I18N{option}

# LINK_COOKIE
source: https://en.wikipedia.org/wiki/HTTP_cookie
sk: https://sk.wikipedia.org/wiki/HTTP_cookie

# LINK_FRI
source: https://www.fri.uniza.sk/en/
sk: https://www.fri.uniza.sk

# JUMPENO_DESCRIPTION
source: Jumpeno is a battle-royale type of game. According to its name, jumping is the key. Your goal is to jump on other players to eliminate them and be the last Jumper standing.
sk: Jumpeno je hra typu battle-royale. Ako už názov hovorí, skákanie je kľúčové. Vaším cieľom je skočiť na ostatných hráčov, eliminovať ich a zostať posledným skokanom nažive.

# JUMPENO_KEYWORDS
source: game, battle-royale, online, jumping, multiplayer
sk: hra, battle-royale, online, skákačka, multiplayer, viac hráčov

source: Mobile menu
sk: Mobilné menu

source: An unexpected error occurred!
sk: Vyskytla sa neočakávaná chyba!

source: Play game
sk: Hrať hru

# LINK_FEEDBACK
source: https://docs.google.com/forms/d/e/1FAIpQLSeoBnWAxfPZmaEE6FWgkkX00Vpp8LKSlfFjdBSs7Te0t0FPFA/viewform?usp=dialog
sk: https://docs.google.com/forms/d/e/1FAIpQLSeQLWT3cKez5q8UY9cJmWmTnKhGd-J4btM0FyM8US9Nua8AqA/viewform?usp=dialog

# TEXT_ABOUT
source: Jumpeno is a battle-royale type of game. According to its name, jumping is the key. Your goal is to jump on other players to eliminate them and be the last <strong>Jumper</strong> standing.
sk: Jumpeno je hra typu battle-royale. Ako už názov hovorí, skákanie je kľúčové. Vaším cieľom je skočiť na ostatných hráčov, eliminovať ich a zostať posledným <strong>skokanom</strong> nažive.

# Please send us your feedback (Please send us your)
source: Please send us your
sk: Prosím, dajte nám

# Please send us your feedback (feedback)
source: feedback
sk: spätnú väzbu

source: Controls
sk: Ovládanie

# CONTROLS_PC
source: Use left and right arrow on your keyboard to move your character, jump is executed by pressing spacebar.
sk: Pre pohyb postavy použite ľavú a pravú šípku, skok vykonáte stlačením klávesy medzerník.

# CONTROLS_MOBILE
source: There are joystick controls for phone and tablet users.
sk: Na mobilnom zariadení a tablete je zobrazený joystick.

source: Play
sk: Hrať

source: Clear
sk: Zmazať

source: Error
sk: Chyba

source: Or @I18N_SPLIT{}login@I18N_SPLIT{} to create new.
sk: Alebo sa @I18N_SPLIT{}prihlás@I18N_SPLIT{} a vytvor novú.

source: Connect to game
sk: Pripojiť sa do hry

source: Connect
sk: Pripojiť sa

source: Game code
sk: Kód hry

source: Code
sk: Kód

source: Your name
sk: Tvoje meno

source: This feature is not available yet.
sk: Táto funkcia zatiaľ nie je dostupná.

source: Game
sk: Hra

source: Length must be equal to I18N{length}
sk: Dĺžka musí byť I18N{length}

source: Code must be alphanumeric
sk: Kód musí byť alfanumerický

source: Code must be uppercase
sk: Malé písmená nie sú povolené

source: Length is not between I18N{min} and I18N{max}
sk: Dĺžka nie je medzi I18N{min} a I18N{max}

source: Name must be alphanumeric
sk: Meno musí byť alfanumerické

source: Name must not start with number
sk: Meno nesmie začínať číslom

source: You have been disconnected from the server.
sk: Boli ste odpojení od servera.

source: Game code is incorrect!
sk: Kód hry je nesprávny!

source: Capacity not between I18N{min} and I18N{max}
sk: Kapacita nie je medzi I18N{min} and I18N{max}

source: The game is currently full!
sk: Kapacita hry je naplnená!

source: Value contains not allowed character
sk: Hodnota obsahuje nepovolený znak

source: Value must not start with a dot
sk: Hodnota nesmie začínať bodkou

source: Player name is taken!
sk: Meno hráča je obsadené!

source: Players
sk: Hráči

source: The game is already running.
sk: Hra práve prebieha.

source: Show
sk: Zobraziť

source: Hide
sk: Skryť

source: Screen too small
sk: Príliš malá obrazovka

source: Rotate screen
sk: Otoč obrazovku

source: Screen connected
sk: Obrazovka pripojená

source: Missing parameters!
sk: Nezadané parametre!

source: User undefined!
sk: Neznámy používateľ!

source: Code not set!
sk: Kód nie je zadaný!

source: Device parameter not set!
sk: Nezadaný parameter typ zariadenia!

source: Spectator parameter not set!
sk: Parameter sledovať nie je zadaný!

source: Game can not have more spectators!
sk: Hra nemôže mať viac sledovateľov!

source: Score
sk: Skóre

source: Pause
sk: Pauza

source: Chat not available
sk: Chat neprístupný

source: Round
sk: Kolo

source: No players
sk: Žiadni hráči

source: Error reading the file!
sk: Chyba pri čítaní súboru!

source: Incorrect field values.
sk: Nesprávne zadané hodnoty.

source: Empty field
sk: Prázdne pole

source: Wrong format
sk: Nesprávny formát

source: Token was sent to your email.
sk: Token bol odoslaný na tvoj e-mail.

source: Email address verification
sk: Overenie e-mailovej adresy

source: Send
sk: Odoslať

source: Check your email address.
sk: Skontroluj svoj e-mail.

source: You can now close this page.
sk: Túto stránku môžeš zavrieť.

source: Hello, here is your login link:
sk: Ahoj, tu je tvoj prihlasovací odkaz:

source: Not authenticated.
sk: Nie ste autentifikovaní.

source: Not authorized.
sk: Nie ste autorizovaní.

source: Log in
sk: Prihlásiť

source: I am admin
sk: Som admin

source: Not a user?
sk: Nemáš účet?

source: Register
sk: Registrovať

source: Password
sk: Heslo

source: This functionality is not implemented yet.
sk: Táto funkcia ešte nie je implementovaná.

source: Registration
sk: Registrácia

source: Have an account?
sk: Máš účet?

source: Player name
sk: Meno hráča

source: Confirm password
sk: Potvrď heslo

source: Bad request.
sk: Nesprávna požiadavka.

source: 403 Not authorized
sk: 403 Neautorizované

source: Error 403
sk: Chyba 403

source: You are not authorized to view this page.
sk: Pre túto stránku nemáte oprávnenie.

source: Reset password
sk: Obnoviť heslo

source: Name forbidden
sk: Meno je zakázané

source: Value undefined
sk: Nedefinovaná hodnota

source: Invalid characters
sk: Nepovolené znaky

source: Not a match
sk: Nezhoduje sa

source: Registration successful.
sk: Registrácia úspešná.

source: Already exists
sk: Už existuje

source: In order to play, account must be activated!
sk: Aby si mohol hrať, účet musí byť aktivovaný!

source: Activation link was sent to your email address.
sk: Aktivačný link bol odoslaný na tvoj email.

source: You can always ask for new one in profile.
sk: Kedykoľvek môžeš požiadať o nový v profile.

source: Jumpeno activation
sk: Jumpeno aktivácia

source: Hello, here is your activation link:
sk: Ahoj, tu je tvoj aktivačný odkaz:

source: Activate
sk: Aktivovať

source: Invalid token.
sk: Neplatný token.

source: Jumpeno password reset
sk: Jumpeno obnova hesla

source: Hello, confirm that your password can be reset to:
sk: Ahoj, potvrď, že tvoje heslo môže byť nastavené na:

source: Confirm reset
sk: Potvrdiť reset

source: Password reset successful.
sk: Reset hesla úspešný.

source: Cookies accepted.
sk: Cookies akceptované.

source: Token invalidated.
sk: Token invalidovaný.

source: Token deleted.
sk: Token zmazaný.

source: Not found.
sk: Nenájdené.

source: Under construction
sk: Pripravuje sa

source: We are working on the implementation of this functionality.
sk: Na implementácii tejto funkcionality pracujeme.

source: 401 Not authenticated
sk: 401 Neautentifikované

source: Error 401
sk: Chyba 401

source: We apologize, you are not logged in.
sk: Ospravedlňujeme sa, nie ste prihlásení.

source: Settings
sk: Nastavenia

source: Log out
sk: Odhlásiť

source: My profile
sk: Môj profil

source: Open
sk: Otvoriť

source: User menu
sk: Používateľské menu

source: Admin menu
sk: Menu administrátora

source: Try again
sk: Skúsiť znovu

source: Account activated
sk: Účet aktivovaný

source: Account not activated
sk: Účet neaktivovaný

source: Resend link
sk: Preposlať odkaz

source: Account already activated.
sk: Účet už je aktivovaný.

source: Activation email sent.
sk: Aktivačný email odoslaný.

source: Create
sk: Vytvoriť

source: Create new game
sk: Vytvoriť novú hru

source: Create game
sk: Vytvoriť hru

source: You are not authorized to create games.
sk: Nemáte oprávnenie vytvárať hry.

source: Connection type invalid!
sk: Nesprávny typ spojenia!

source: Invalid value
sk: Nesprávna hodnota

source: Equal values of I18N{value1} and I18N{value2}
sk: Zhoda hodnôt I18N{value1} a I18N{value2}

source: Equal values
sk: Zhoda hodnôt

source: Not a match of I18N{value1} and I18N{value2}
sk: Nezhoda hodnôt I18N{value1} a I18N{value2}

source: Failed to send activation email.
sk: Nepodarilo sa odoslať aktivačný email.

source: Active games
sk: Aktívne hry

source: Testing
sk: Testovanie

source: Database
sk: Databáza

source: Use credentials from the connection string
sk: Použi údaje z connection stringu

source: Credentials
sk: Údaje

source: Emails, files and forms
sk: Správy, súbory a formuláre

source: Two-factor authentication (2FA)
sk: Dvojfaktorová autentifikácia (2FA)

source: Get your access from email admin.
sk: Prístup získaš od správcu mailu.

source: In case of emergency use the backup key.
sk: V núdzi použi záložný kľúč.

source: Generate and set new secret after!
sk: Potom vygeneruj a nastav nový secret!

source: Backup keys
sk: Záložné kľúče

source: Account is not activated!
sk: Účet nie je aktivovaný!

source: Capacity
sk: Kapacita

# players0
source: players
sk: hráčov

# players1
source: player
sk: hráč

# players2+
source: players
sk: hráči

# players5+
source: players
sk: hráčov

source: Designer
sk: Dizajnér

source: Search
sk: Hľadať

source: No data
sk: Žiadne dáta

source: Selected total: I18N{count}
sk: Zvolené celkom: I18N{count}

source: Selected: I18N{option}, plus: I18N{count}
sk: Zvolené: I18N{option}, plus: I18N{count}

source: Selected
sk: Zvolené

source: Game maps
sk: Herné mapy

source: Manage
sk: Spravovať
